Revit 2027 API
BuiltInFailures.GroupFailures.AtomViolationWhenOnePlaceInstance Property
 A group has been changed outside group edit mode. The change is being allowed because there is only one instance of the type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AtomViolationWhenOnePlaceInstance { get; }
Public Shared ReadOnly Property AtomViolationWhenOnePlaceInstance As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AtomViolationWhenOnePlaceInstance {
	FailureDefinitionId^ get ();
}
static member AtomViolationWhenOnePlaceInstance : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace